УТ_для_edt.РасширениеСмарт/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Склады</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТекущаяДолжностьОтветственного</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриПоступлении</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаИспользованияСкладскихПомещений</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИспользованиеРабочихУчастков</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСкладскиеПомещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦеховаяКладовая</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИсточникИнформацииОЦенахДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>УчетныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РозничныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТекущийОтветственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыПриходныхОрдеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыРасходныхОрдеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаНачалаАдресногоХраненияОстатков</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыПересчетовТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтролироватьОперативныеОстатки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НастройкаАдресногоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДляПоступленияГрузов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСерииНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="39299529-e597-4f8e-a8bf-4eb5dc180cbb">
    <name>ВыборГруппы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff476f7c-83dd-4bf3-b877-ee64c1fc2c1c">
    <name>ИспользоватьАдресноеХранение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6058b2d6-0f5a-4298-8e5c-da1204a63027">
    <name>смартПриоритетДляСпособаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СпособыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Самовывоз</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ДоКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаПоАдресу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КПолучателюОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаДоПунктаПередачи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПоставщикаДоНашегоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НашимиСиламиСАдресаОтправителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаДоНашегоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтОтправителяОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5d20c737-5039-4cee-a650-bca499bbc637">
    <name>смартСамовывозСоСкладаАдмирал</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ecbfed88-7ed7-45eb-a8d5-8c11f88fbc12">
    <name>ПоручениеЭкспедиторуНаСклад</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="64858d0d-3081-4b86-946a-23810f59eebc">
    <name>ПоручениеЭкспедиторуСоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="266e90f6-450a-4536-8666-1cbbb3eedb6c">
    <name>ПоручениеЭкспедиторуВПункте</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Склады/Forms/ФормаЭлемента/Module.bsl
#Область ПеренесеноСДоработкамиСмарт

//++#1012 смарт: Холопов 04.05.2022 // Добавление подсказок для телефонов в КИ 
&НаСервере
&После("КонтактнаяИнформацияПриСменеСтраницы")
Процедура смарт_КонтактнаяИнформацияПриСменеСтраницы()
	смартОбщегоНазначения.ДобавитьПодсказкиКонтактнаяИнформация(ЭтотОбъект);	
КонецПроцедуры
//--#1012 смарт: Холопов 04.05.2022

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);

	Если Параметры.Свойство("ЗначенияЗаполнения") И Параметры.ЗначенияЗаполнения.Свойство("ТипСклада") Тогда
		ТипаСкладаПриИзмененииСервер();
	КонецЕсли;

	// СтандартныеПодсистемы.КонтактнаяИнформация
	ДополнительныеПараметрыКИ = УправлениеКонтактнойИнформацией.ПараметрыКонтактнойИнформации();
	ДополнительныеПараметрыКИ.Вставить("ИмяЭлементаДляРазмещения", "ГруппаКонтактнаяИнформация");
	ДополнительныеПараметрыКИ.Вставить("ОтложеннаяИнициализация", Истина);
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтаФорма, Объект, ДополнительныеПараметрыКИ);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация

	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Склад, Помещение", Объект.Ссылка, Справочники.СкладскиеПомещения.ПустаяСсылка()));

	ИспользоватьНесколькоВидовЦен = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВидовЦен");

	УстановитьВидимостьПоФО();
	НастроитьЭлементыФормыПоПравамДоступа();

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		КонтролироватьОбеспечение = Истина;
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;

	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	// подсистема запрета редактирования ключевых реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

	ОбновитьЗаголовокФормы(ЭтаФорма);
	
	#Вставка
	//++#1221 смарт: Лопато 25.10.2022 //Изменить приоритет склада отгрузки  

	НовыйЭлемент = Этаформа.Элементы.Вставить("смартГруппаДополнительно", Тип("ГруппаФормы"), ЭтаФорма.Элементы.ОсновноеЛево, Неопределено);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Заголовок = "Дополнительно";
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартПриоритетДляСпособаДоставки", Тип("ПолеФормы"), ЭтаФорма.Элементы.смартГруппаДополнительно);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартПриоритетДляСпособаДоставки";
	НовыйЭлемент.КнопкаВыпадающегоСписка = Истина;
	НовыйЭлемент.КнопкаОчистки = Истина;
	НовыйЭлемент.Ширина = 0;
	НовыйЭлемент.МаксимальнаяШирина = 33;
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	НовыйЭлемент.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВВыпадающемСписке;
	НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	
	НовыйЭлемент.РежимВыбораИзСписка = Истина;
	НовыйЭлемент.СписокВыбора.Очистить();
	НовыйЭлемент.СписокВыбора.Добавить(Перечисления.СпособыДоставки.Самовывоз, 							 "Самовывоз (с нашего склада)");
	НовыйЭлемент.СписокВыбора.Добавить(Перечисления.СпособыДоставки.ДоКлиента, 							 "Наша транспортная служба до клиента");
	НовыйЭлемент.СписокВыбора.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу, 			 "Наша транспортная служба до перевозчика");
	НовыйЭлемент.СписокВыбора.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчика, 					 "Перевозчик (с нашего склада)");
	НовыйЭлемент.СписокВыбора.Добавить(Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки, "На усмотрение транспортной службы");
	НовыйЭлемент.СписокВыбора.Добавить(Перечисления.СпособыДоставки.смартСамовывозСоСкладаАдмирал, 		 "Самовывоз со склада Адмирал/Атлант");

	смартСервер.смартДобавитьКнопкуИнформацииНаФорму("смартПриоритетДляСпособаДоставки", "поле ""Приоритет для способа доставки""", 
													 ЭтаФорма.Элементы.смартГруппаДополнительно, ЭтаФорма);
	
//--#1221 смарт: Лопато 25.10.2022 
    //++ #1351 смарт: Фролов 11.05.2023 //Разделение остатков по организациям в заказах  
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартГруппаНазначениеСклада", Тип("ГруппаФормы"), ЭтаФорма.Элементы.ОсновноеЛево, Неопределено);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартНазначениеСклада", Тип("ПолеФормы"), ЭтаФорма.Элементы.смартГруппаНазначениеСклада);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартНазначениеСклада";
	НовыйЭлемент.КнопкаВыпадающегоСписка = Истина;
	НовыйЭлемент.КнопкаОчистки = Истина;
	НовыйЭлемент.Ширина = 0;
	НовыйЭлемент.МаксимальнаяШирина = 33;
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	НовыйЭлемент.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВВыпадающемСписке;
	НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать; 
	
	смартСервер.смартДобавитьКнопкуИнформацииНаФорму("смартНазначениеСклада", "поле ""Назначение склада""", 
													 ЭтаФорма.Элементы.смартГруппаНазначениеСклада, ЭтаФорма);
	//-- #1351 смарт: Фролов 11.05.2023  
	//++ #1353 смарт: Фролов 16.05.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)  
	НовыйЭлемент = Этаформа.Элементы.Добавить("смартСтраницаНастройкиОтправкиДокументов", Тип("ГруппаФормы"), ЭтаФорма.Элементы.ГруппаСтраницы);
	НовыйЭлемент.Вид = ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок="Настройки отправки документов (смарт)";
	
	НовыйЭлемент = Этаформа.Элементы.Добавить("смартАвтоматическиФормироватьДокументы", Тип("ПолеФормы"), ЭтаФорма.Элементы.смартСтраницаНастройкиОтправкиДокументов);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.смартАвтоматическиФормироватьДокументы"; 
	НовыйЭлемент.Подсказка = "Устанновка этого признака необходима, если выдача документов происходит на складе ответ. хранения и необходимо формировать заявки на авто."+Символы.ПС+
								"ОБЯЗАТЕЛЬНО прописать склад в организации на вкладке Группа грузополучатели (смарт)! Задача №1353";
	
	НовыйЭлемент = Этаформа.Элементы.Добавить("смартФормироватьДокументыУТБП", Тип("ПолеФормы"), ЭтаФорма.Элементы.смартСтраницаНастройкиОтправкиДокументов);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартФормироватьДокументыУТБП"; 
	НовыйЭлемент.Подсказка = "Выбор этого параметра влияет, из какой базы будет сформирован УПД в каталог на сервере для последующей отправки на почту. Задача №1353";
	
	НовыйЭлемент = Этаформа.Элементы.Добавить("смартКаталогСклада", Тип("ПолеФормы"), ЭтаФорма.Элементы.смартСтраницаНастройкиОтправкиДокументов);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартКаталогСклада"; 
	НовыйЭлемент.Подсказка = "Каталог необходимо указать как формате smb. Например \\s1\Данные\Admiral  Задача №1353";
	
	НовыйЭлемент = Этаформа.Элементы.Добавить("смартАдресаДляОтправкиПакетаНаСклад", Тип("ТаблицаФормы"), ЭтаФорма.Элементы.смартСтраницаНастройкиОтправкиДокументов);
	НовыйЭлемент.ПутьКДанным = "Объект.смартАдресаДляОтправкиПакетаНаСклад"; 
	НовыйЭлемент.Ширина = 0;
	НовыйЭлемент.МаксимальнаяШирина = 70;
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	НовыйЭлемент.Высота = 0;
	НовыйЭлемент.МаксимальнаяВысота = 5;
	НовыйЭлемент.АвтоМаксимальнаяВысота = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("Адрес", Тип("ПолеФормы"), Элементы.смартАдресаДляОтправкиПакетаНаСклад);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартАдресаДляОтправкиПакетаНаСклад.смартАдресДляОтправкиПакетаНаСклад"; 
	//-- #1353 смарт: Фролов 16.05.2023  
	//++ #1353 смарт: Фролов 06.09.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)  
	НовыйЭлемент = Элементы.Добавить("Доставка", Тип("ПолеФормы"), Элементы.смартАдресаДляОтправкиПакетаНаСклад);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартАдресаДляОтправкиПакетаНаСклад.смартДоставка"; 
	НовыйЭлемент = Элементы.Добавить("Самовывоз", Тип("ПолеФормы"), Элементы.смартАдресаДляОтправкиПакетаНаСклад);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартАдресаДляОтправкиПакетаНаСклад.смартСамовывоз"; 
    //-- #1353 смарт: Фролов 06.09.2023
	
	//++ #1369 смарт: Фролов 06.06.2023 //Рассылка при поступлении запчастей Ковчег  
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартСтраницаРассылкаОПриходе",Тип("ГруппаФормы"),ЭтаФорма.Элементы.ГруппаСтраницы,Неопределено);
	НовыйЭлемент.Вид = ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок = "Рассылки о приходе товара (смарт)";
	НовыйЭлемент.Подсказка = "Рассылки о приходе товара (смарт)";  

	НовыйЭлемент = Этаформа.Элементы.Вставить("смартОтправлятьОповещенияОПриходеТовара",Тип("ПолеФормы"),ЭтаФорма.Элементы.смартСтраницаРассылкаОПриходе,Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.смартОтправлятьОповещенияОПриходеТовара"; 
	НовыйЭлемент.Подсказка = "Данный флажок означает, что при проведении приходного ордера на этот склад будет отправлено оповещение о приходе товаров, списку адресатов ниже.  Задача №1369";
	
	ТаблицаАдресов = Этаформа.Элементы.Добавить("смартАдресаДляОтправкиОповещенийОПриходеТовара", Тип("ТаблицаФормы"), ЭтаФорма.Элементы.смартСтраницаРассылкаОПриходе);
	ТаблицаАдресов.ПутьКДанным = "Объект.смартАдресаДляОтправкиОповещенийОПриходеТовара"; 
	ТаблицаАдресов.Ширина = 0;
	ТаблицаАдресов.МаксимальнаяШирина = 70;
	ТаблицаАдресов.АвтоМаксимальнаяШирина = Ложь;
	ТаблицаАдресов.Высота = 0;
	ТаблицаАдресов.МаксимальнаяВысота = 5;
	ТаблицаАдресов.АвтоМаксимальнаяВысота = Ложь;

	ЭлементТаблицыФормы = Элементы.Добавить("КолонкаАдресДляОтправкиОповещенияОПриходеТовара", Тип("ПолеФормы"),ТаблицаАдресов);
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.смартАдресаДляОтправкиОповещенийОПриходеТовара.смартАдресДляОтправкиОповещенияОПриходеТовара";
	ЭлементТаблицыФормы.Ширина=10;
	
	//-- #1369 смарт: Фролов 06.06.2023
	
	//++ #Б-1574 смарт: Фролов 06.12.2024 //Доработать форму элемента справочника Склад
	НовыйЭлемент = Элементы.Добавить("смартКомментарий", Тип("ПолеФормы"), Элементы.ОсновноеЛево);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартКомментарий";
	НовыйЭлемент.МногострочныйРежим = Истина;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	НовыйЭлемент.Ширина = 60;
	НовыйЭлемент.АвтоМаксимальнаяВысота = Ложь;
	НовыйЭлемент.Высота = 4;
	//-- #Б-1574 смарт: Фролов 06.12.2024
	
	//++ #Б6916 смарт: Шляпников 19.05.2026 / Интеграция с WMS. Атлант-Чехов. Лоджистикпро. Доработать.
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартНастройкаОбменомСАтлант", "смартГруппаДополнительно",, 1, "Объект.смартНастройкаОбменомСАтлант");
	//-- #Б6916 смарт: Шляпников 19.05.2026
	#КонецВставки
	
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

// Богус++
&НаКлиенте
Процедура ДляПоступленияГрузовПриИзменении(Элемент)
	
	Если Не Объект.ДляПоступленияГрузов Тогда
		Возврат;
	КонецЕсли;	
		
	ДляПоступленияГрузовПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ДляПоступленияГрузовПриИзмененииСервер()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Склады.Ссылка
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.Ссылка <> &Склад
		|	И Склады.ДляПоступленияГрузов";

	Запрос.УстановитьПараметр("Склад", Объект.Ссылка);

	Результат = Запрос.Выполнить();

	Если Не Результат.Пустой() Тогда
		 Объект.ДляПоступленияГрузов = Ложь;
		 Сообщить("Склад для поступления грузов уже существует.");
	КонецЕсли;	 
	
КонецПроцедуры
// Богус--

&НаКлиенте
Процедура смартДействиеПоказатьИнформацию(Команда)
//++#1221 смарт: Лопато 25.10.2022 //Изменить приоритет склада отгрузки  
	
	Если СтрНайти(Команда.Имя, "смартПриоритетДляСпособаДоставки") <> 0 Тогда

		ИнформацияЗаголовок = "Приоритет для способа доставки";

		ИнформацияТекст = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
			  НСтр("ru = 'В поле <b>Приоритет для способа доставки</b> указывается способ доставки, при выборе которого '")
			+ НСтр("ru = 'в документе отгрузки функция заполнения обеспечения будет считать данный склад приоритетным (при прочих равных условиях по доступности товара).'")
			+ Символы.ПС
			+ Символы.ПС
			+ НСтр("ru = 'Если один и тот же способ доставки будет указан в нескольких складах, то более высокий приоритет будет установлен по наименованию склада по принципу сортировки по алфавиту.'")
			);
	//++ #1351 смарт: Фролов 11.05.2023 //Разделение остатков по организациям в заказах  
	ИначеЕсли СтрНайти(Команда.Имя, "смартНазначениеСклада") <> 0 Тогда 
		ИнформацияЗаголовок = "Назначение склада";

		ИнформацияТекст = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
			  НСтр("ru = 'В поле <b>Назначение склада</b> указывается вид склада '")
			+ Символы.ПС
			+ НСтр("ru = 'В зависимости от выбранного назначения склада, система будет по разному обрабатывать данные.'")
			+ Символы.ПС
			+ НСтр("ru = 'В частности, получение свободных остатков, для продажи, имеет смысл только для видов <b>Торговый склад</b> и <b>Демо зал</b>.'")
			);
	//-- #1351 смарт: Фролов 11.05.2023
	Иначе
		ИнформацияЗаголовок = "";
		ИнформацияТекст = "";	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИнформацияЗаголовок) И ЗначениеЗаполнено(ИнформацияТекст) Тогда
		ОткрытьФорму("ОбщаяФорма.смартФормаИнформацияПоДоработкам", Новый Структура("Заголовок, Информация", ИнформацияЗаголовок, ИнформацияТекст), ЭтаФорма);
	КонецЕсли;

//--#1221 смарт: Лопато 25.10.2022
КонецПроцедуры	

#КонецОбласти
